app/controllers/results_controller.rb

  def create
    Result.save_results(params[:quizResults])
---
INSERT INTO "results" ("user_id", "word", "meaning", "is_correct", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["word", "printer"], ["meaning", "プリンター、印刷装置"], ["is_correct", 0], ["created_at", "2020-11-01 03:40:43.983304"], ["updated_at", "2020-11-01 03:40:43.983304"]]

  def create_type
    if params[:results].present?
      result =Result.new
      result.word =params[:results][:answer]
      result.meaning =params[:results][:text]
      result.is_correct =1
      result.user_id =1
      result.save
    end
    if params[:miss].present?
      result =Result.new
      result.word =params[:miss][:answer]
      result.meaning =params[:miss][:text]
      result.is_correct =0
      result.user_id =1
      result.save
---
INSERT INTO "results" ("user_id", "word", "meaning", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["word", "～のそばで、傍らに、脇に"], ["meaning", "beside"], ["created_at", "2020-11-02 05:19:34.266188"], ["updated_at", "2020-11-02 05:19:34.266188"]]
INSERT INTO "results" ("user_id", "word", "meaning", "is_correct", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["word", "得をする、利益を得る"], ["meaning", "benefit(s)"], ["is_correct", 0], ["created_at", "2020-11-01 16:21:43.141731"], ["updated_at", "2020-11-01 16:21:43.141731"]]