app/controllers/tops_controller.rb

SELECT "results".* FROM "results"
SELECT  "word_sets".* FROM "word_sets" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT  "word_sets".* FROM "word_sets" LIMIT ?  [["LIMIT", 250]]
---
  def kakutan
    # gon.words = Word.generate
    @results = Result.all.shuffle
    @lines = Fileloader.get_lines(0)
    # @kakutanpdf = KakutanPdf.new(@result)
    # @word_set = @kakutanpdf.contents(@result)
    # binding.pry
    word_set = []
    for i in 2..@lines.last_row do
      word_set.push([@lines.row(i)[1], @lines.row(i)[2]])
    end
    word_set_shuffle = word_set.shuffle
    gon.word_set = word_set_shuffle[Range.new(0, 499)]
    @word_sets = WordSet.all.page(params[:page])
    @without_page = WordSet.all