app/models/result.rb

    def self.save_results(quizResults)
        i = 0
        while (quizResults[i.to_s]) do
            if !quizResults[i.to_s][:user_id]
                break
            end
            result = Result.new(word:quizResults[i.to_s][:en_word],
                        meaning:quizResults[i.to_s][:answer],
                        is_correct:quizResults[i.to_s][:status] ,user_id:quizResults[i.to_s][:user_id])
            result.save
---
INSERT INTO "results" ("user_id", "word", "meaning", "is_correct", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["word", "printer"], ["meaning", "プリンター、印刷装置"], ["is_correct", 0], ["created_at", "2020-11-01 03:40:43.983304"], ["updated_at", "2020-11-01 03:40:43.983304"]]